Eclo/nf-interpreter/targets/AzureRTOS/ST/ST_STM32H735G_DK/nanoBooter/main.c
//
// Copyright (c) .NET Foundation and Contributors
// See LICENSE file in the project root for full license information.
//

#include <stm32h7xx_hal.h>
#include <targetHAL.h>
#include <nanoPAL_BlockStorage.h>
#include <nanoHAL_ConfigurationManager.h>
#include <LaunchCLR.h>

// byte pool configuration and definitions
#define DEFAULT_BYTE_POOL_SIZE 4096
TX_BYTE_POOL byte_pool_0;
uint8_t memory_area[DEFAULT_BYTE_POOL_SIZE];

// threads definitions and configurations

// receiver thread
#define RECEIVER_THREAD_STACK_SIZE 2048
#define RECEIVER_THREAD_PRIORITY   5

TX_THREAD receiverThread;
uint32_t receiverThreadStack[RECEIVER_THREAD_STACK_SIZE / sizeof(uint32_t)];
extern void ReceiverThread_entry(uint32_t parameter);

// blink thread
#define BLINK_THREAD_STACK_SIZE 1024
#define BLINK_THREAD_PRIORITY   5

TX_THREAD blinkThread;
uint32_t blinkThreadStack[BLINK_THREAD_STACK_SIZE / sizeof(uint32_t)];

void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
void MPU_Config(void);
void MX_GPIO_Init(void);
extern uint32_t NF_UsbX_Init(void);

void BlinkThread_entry(uint32_t parameter)
{
    (void)parameter;

    while (1)
    {
        HAL_GPIO_TogglePin(GPIOG, GPIO_PIN_7);
        tx_thread_sleep(TX_TICKS_PER_MILLISEC(500));
    }
}

void tx_application_define(void *first_unused_memory)
{
    (void)first_unused_memory;
    uint16_t status;

    // Create a byte memory pool from which to allocate the thread stacks.
    tx_byte_pool_create(&byte_pool_0, "byte pool 0", memory_area, DEFAULT_BYTE_POOL_SIZE);

// #if (HAL_NF_USE_STM32_CRC == TRUE)
//     // startup crc
//     crcStart(NULL);
// #endif

 NF_UsbX_Init();

    // initialize block storage list and devices
    // in CLR this is called in nanoHAL_Initialize()
    // for nanoBooter we have to init it in order to provide the flash map for Monitor_FlashSectorMap command
    BlockStorageList_Initialize();
    BlockStorage_AddDevices();

    // initialize configuration manager
    // in CLR this is called in nanoHAL_Initialize()
    // for nanoBooter we have to init it here to have access to network configuration blocks
    ConfigurationManager_Initialize();

    // Create blink thread
    status = tx_thread_create(
        &blinkThread,
        "Blink Thread",
        BlinkThread_entry,
        0,
        blinkThreadStack,
        BLINK_THREAD_STACK_SIZE,
        BLINK_THREAD_PRIORITY,
        BLINK_THREAD_PRIORITY,
        TX_NO_TIME_SLICE,
        TX_AUTO_START);

    if (status != TX_SUCCESS)
    {
        while (1)
        {
        }
    }

    // // Create receiver thread
    // status = tx_thread_create(
    //     &receiverThread,
    //     "Receiver Thread",
    //     ReceiverThread_entry,
    //     0,
    //     receiverThreadStack,
    //     RECEIVER_THREAD_STACK_SIZE,
    //     RECEIVER_THREAD_PRIORITY,
    //     RECEIVER_THREAD_PRIORITY,
    //     TX_NO_TIME_SLICE,
    //     TX_AUTO_START);

    // if (status != TX_SUCCESS)
    // {
    //     while (1)
    //     {
    //     }
    // }

    // report successfull nanoBooter execution
    ReportSuccessfullNanoBooter();
}

//  Application entry point.
int main(void)
{
    MPU_Config();
    SCB_EnableICache();
    SCB_EnableDCache();
    HAL_Init();
    SystemClock_Config();
    PeriphCommonClock_Config();
    MX_GPIO_Init();

    // MX_USART1_UART_Init();
    // MX_DMA_Init();

    // halInit();

    // init boot clipboard
    InitBootClipboard();

    // the following IF is not mandatory, it's just providing a way for a user to 'force'
    // the board to remain in nanoBooter and not launching nanoCLR

    // check if there is a request to remain on nanoBooter
    if (!IsToRemainInBooter())
    {
        // if the USER/BOOT1 button is pressed, skip the check for a valid CLR image and remain in booter
        // the user button in this board has a pull-up resistor so the check has to be inverted
        if (HAL_GPIO_ReadPin(GPIOK, GPIO_PIN_7))
        {
            // check for valid CLR image
            // we are checking for a valid image right after the configuration block
            if (CheckValidCLRImage((uint32_t)&__nanoConfig_end__))
            {
                // there seems to be a valid CLR image
                // launch nanoCLR
                LaunchCLR((uint32_t)&__nanoConfig_end__);
            }
        }
    }

    // //  Initializes a serial-over-USB CDC driver.
    // sduObjectInit(&SERIAL_DRIVER);
    // sduStart(&SERIAL_DRIVER, &serusbcfg);

    // // Activates the USB driver and then the USB bus pull-up on D+.
    // // Note, a delay is inserted in order to not have to disconnect the cable after a reset.
    // usbDisconnectBus(serusbcfg.usbp);
    // osalThreadSleepS(OSAL_MS2I(100));
    // usbStart(serusbcfg.usbp, &usbcfg);
    // usbConnectBus(serusbcfg.usbp);

    // Enter the ThreadX kernel
    tx_kernel_enter();
}
